Documents/РегламентированныйОтчет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>РегламентированныйОтчет</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидУчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыУчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеПериода</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПорядкиОкругленияОтчетности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТочностьЕдиницыИзмерения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтчетНаКонецПрошлогоГода</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РегламентированныйОтчет</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтчетНаКонецПозапрошлогоГода</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РегламентированныйОтчет</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтчетЗаПоследнийКвартал</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеОтчета</Name>
					<Comment>Наименование регламентированного отчета</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникОтчета</Name>
					<Comment>Имя объекта метаданных Отчет</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>254</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыбраннаяФорма</Name>
					<Comment>Выбранная форма</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>254</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РедакцияФормы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>254</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДанныеОтчета</Name>
					<Comment>Сохраненные данные отчета</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусОтчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерКорректировки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НестандартныйПериод</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПереходНаМСФО9</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/РегламентированныйОтчет/Forms/ФормаСозданияОтчета/Ext/Form/Module.bsl
&НаКлиенте
Процедура ВидыОтчетовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ОткрытьФормуОтчета(Элементы.ВидыОтчетов.ТекущиеДанные, ПараметрыФормы.Организация, 
									ПараметрыФормы.СчетДоверительногоУправления, 
									ПараметрыФормы.ДатаНачалаПериодаОтчета, 
									ПараметрыФормы.ДатаКонцаПериодаОтчета, Истина);
									
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
	
	ОткрытьФормуОтчета(Элементы.ВидыОтчетов.ТекущиеДанные, ПараметрыФормы.Организация, 
									ПараметрыФормы.СчетДоверительногоУправления, 
									ПараметрыФормы.ДатаНачалаПериодаОтчета, 
									ПараметрыФормы.ДатаКонцаПериодаОтчета, Истина);
									
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуОтчета(ДанныеОтчета, ОрганизацияОтчета, СчетДоверительногоУправления, 
					ДатаНачалаПериодаОтчета, ДатаОкончанияПериодаОтчета, ЭтоВыбор = Ложь)
		
	РезультатОткрытияФормыНаСервере = Неопределено;
		
	Отказ = Ложь;
		
		
	РезультатОткрытияФормыНаСервере = ОткрытьФормуОтчетаНаСервере(ДанныеОтчета.Значение, ОрганизацияОтчета, СчетДоверительногоУправления, 
												ДатаНачалаПериодаОтчета, ДатаОкончанияПериодаОтчета);
	
	Если РезультатОткрытияФормыНаСервере = "Не удалось открыть отчет" Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(РезультатОткрытияФормыНаСервере, , , , Отказ);
		
	ИначеЕсли ТипЗнч(РезультатОткрытияФормыНаСервере) = Тип("Структура") Тогда
		
		ЭтоРСБУ = Ложь;
		ЭтоРСБУ = ?(РезультатОткрытияФормыНаСервере.Свойство("ЭтоРСБУ", ЭтоРСБУ), ЭтоРСБУ, Ложь);
		
		Если ЭтоРСБУ = Неопределено Тогда 
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Невозможно выбрать вариант баланса. Параметры учета не заданы.", , , , Отказ); 
		Иначе		
			ИмяФормыОтчета = "Отчет." + РезультатОткрытияФормыНаСервере.Отчет + ?(ЭтоРСБУ,"РСБУ","") + ".Форма.ОсновнаяФорма";
		КонецЕсли;	
			
	КонецЕсли;
		
	Если Не Отказ Тогда
		
		Если ЭтоВыбор Тогда
			
			ПараметрыВыбора = Новый Структура;
			ПараметрыВыбора.Вставить("СчетДоверительногоУправления", 	ПараметрыФормы.СчетДоверительногоУправления);
			ПараметрыВыбора.Вставить("Организация", 					ПараметрыФормы.Организация);
			ПараметрыВыбора.Вставить("ДатаНачалаПериодаОтчета", 		ПараметрыФормы.ДатаНачалаПериодаОтчета);
			ПараметрыВыбора.Вставить("ДатаКонцаПериодаОтчета", 			ПараметрыФормы.ДатаКонцаПериодаОтчета);
			ПараметрыВыбора.Вставить("ПредставлениеВидаОтчета",			ДанныеОтчета.Значение);
			ПараметрыВыбора.Вставить("ИмяФормыОтчета",					ИмяФормыОтчета);
			
			ЭтаФорма.ВладелецФормы.ПараметрыВыбораФормыСоздания = ПараметрыВыбора;
			Закрыть();
			
		Иначе
			
			ОткрытьФорму(ИмяФормыОтчета, РезультатОткрытияФормыНаСервере, ЭтаФорма.ВладелецФормы, 
					ИмяФормыОтчета,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ОткрытьФормуОтчетаНаСервере(Отчет, ОрганизацияОтчета, СчетДоверительногоУправления
											  , ДатаНачалаПериодаОтчета = Неопределено
											  , ДатаОкончанияПериодаОтчета = Неопределено)
											  
	
	Если Метаданные.Отчеты.Найти(Отчет) = Неопределено Тогда
		Возврат "Не удалось открыть отчет";
	КонецЕсли;
	
	ПараметрыТекФормы = Новый Структура;
	ПараметрыТекФормы.Вставить("Организация");
	ПараметрыТекФормы.Вставить("СчетДоверительногоУправления");
	ПараметрыТекФормы.Вставить("мДатаНачалаПериодаОтчета");
	ПараметрыТекФормы.Вставить("мДатаКонцаПериодаОтчета");
	
	
	ПараметрыТекФормы.Организация = ОрганизацияОтчета;
	ПараметрыТекФормы.СчетДоверительногоУправления = СчетДоверительногоУправления;
	
	Если ЗначениеЗаполнено(ДатаНачалаПериодаОтчета) ИЛИ ЗначениеЗаполнено(ДатаОкончанияПериодаОтчета) Тогда
		
		ПараметрыТекФормы.мДатаНачалаПериодаОтчета = ?(ТипЗнч(ДатаНачалаПериодаОтчета) = Тип("Дата") И ДатаНачалаПериодаОтчета <> Дата(1,1,1), НачалоДня(ДатаНачалаПериодаОтчета), Неопределено);
		ПараметрыТекФормы.мДатаКонцаПериодаОтчета = ?(ТипЗнч(ДатаОкончанияПериодаОтчета) = Тип("Дата") И ДатаОкончанияПериодаОтчета <> Дата(1,1,1), КонецДня(ДатаОкончанияПериодаОтчета), Неопределено);
		
	КонецЕсли;
	
	Если (Отчет = "РегламентированныйОтчетБаланс" ИЛИ Отчет = "РегламентированныйОтчетОФинансовыхРезультатах") 
		И ЗначениеЗаполнено(СчетДоверительногоУправления) Тогда
		
		ПараметрыТекФормы.Вставить("ЭтоРСБУ");
												  
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	НастройкиУчетаОбщиеСрезПоследних.ВестиБухгалтерскийУчет КАК ВестиБухгалтерскийУчет,
			|	НастройкиУчетаОбщиеСрезПоследних.ВестиЕдиныйБухгалтерскийУчет КАК ВестиЕдиныйБухгалтерскийУчет
			|ИЗ
			|	РегистрСведений.НастройкиУчетаОбщие.СрезПоследних(
			|			&Период,
			|			Организация = &Организация
			|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК НастройкиУчетаОбщиеСрезПоследних";
		
		Запрос.УстановитьПараметр("Организация", ОрганизацияОтчета);
		Запрос.УстановитьПараметр("Период", ДатаОкончанияПериодаОтчета);
		Запрос.УстановитьПараметр("СчетДоверительногоУправления", СчетДоверительногоУправления);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Если ВыборкаДетальныеЗаписи.ВестиЕдиныйБухгалтерскийУчет Тогда
				ПараметрыТекФормы.ЭтоРСБУ = Ложь;										  
			ИначеЕсли ВыборкаДетальныеЗаписи.ВестиБухгалтерскийУчет Тогда
				ПараметрыТекФормы.ЭтоРСБУ = Истина;										  
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	ПараметрыТекФормы.Вставить("Отчет", Отчет);
	
	Возврат ПараметрыТекФормы;
	
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Организация",             		Параметры.Организация);
	ПараметрыФормы.Вставить("СчетДоверительногоУправления", Параметры.СчетДоверительногоУправления);
	ПараметрыФормы.Вставить("ДатаНачалаПериодаОтчета", 		Параметры.ДатаНачалаПериодаОтчета);
	ПараметрыФормы.Вставить("ДатаКонцаПериодаОтчета",  		Параметры.ДатаКонцаПериодаОтчета);
	ПараметрыФормы.Вставить("ПредставлениеВидаОчета",  		Параметры.ПредставлениеВидаОтчета);
	
	ВидыОтчетов = Документы.РегламентированныйОтчет.ПолучитьСписокВидовРегламентированныхОтчетов();
	
	Если ЗначениеЗаполнено(Параметры.ПредставлениеВидаОтчета) Тогда
		ВыбранныйОтчет = ВидыОтчетов.НайтиПоЗначению(Параметры.ПредставлениеВидаОтчета);
		ДанныеНайденногоВидаОтчета = Новый Структура("Значение", ВыбранныйОтчет.Значение) 
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ТипЗнч(ДанныеНайденногоВидаОтчета) = Тип("Структура") Тогда
		
		ОткрытьФормуОтчета(ДанныеНайденногоВидаОтчета, ПараметрыФормы.Организация, ПараметрыФормы.СчетДоверительногоУправления,
									ПараметрыФормы.ДатаНачалаПериодаОтчета, ПараметрыФормы.ДатаКонцаПериодаОтчета);
		
		Отказ = Истина;
			
	КонецЕсли;
	
КонецПроцедуры
